classify = {
    "语种": ["华语", "欧美", "日语", "韩语", "粤语", "小语种", ],
    "风格": ["流行", "摇滚", "民谣", "电子", "舞曲", "说唱", "轻音乐", "爵士", "乡村", "R&B/Soul", "古典", "民族", "英伦", "金属", "朋克", "蓝调", "雷鬼", "世界音乐", "拉丁", "另类/独立", "New Age", "古风", "后摇", "Bossa Nova"],
    "场景": ["清晨", "夜晚", "学习", "工作", "午休", "下午茶", "地铁", "驾车", "运动", "旅行", "散步", "酒吧"],
    "情感": ["怀旧", "清新", "浪漫", "性感", "伤感", "治愈", "放松", "孤独", "感动", "兴奋", "快乐", "安静", "思念"],
    "主题": ["影视原声", "ACG", "校园", "游戏", "70后", "80后", "90后", "网络歌曲", "KTV", "经典", "翻唱", "吉他", "钢琴", "器乐", "榜单", "00后"]
}

top_list = {
    '云音乐特色榜': [{'云音乐飙升榜': '19723756'}, {'云音乐新歌榜': '3779629'}, {'网易原创歌曲榜': '2884035'}, {'云音乐热歌榜': '3778678'}],
    '全球媒体榜': [{'江小白YOLO云音乐说唱榜': '991319590'}, {'国风风云榜': '2534472105'}, {'云音乐电音榜': '1978921795'}, {'斗鱼音乐榜': '2572444046'},
              {'抖音排行榜': '2250011882'}, {'云音乐ACG音乐榜': '71385702'}, {'云音乐古典音乐榜': '71384707'}, {'云音乐韩语榜': '745956260'},
              {'云音乐国电榜': '10520166'}, {'英国Q杂志中文版周榜': '2023401535'}, {'电竞音乐榜': '2006508653'}, {'UK排行榜周榜': '180106'},
              {'美国Billboard周榜': '60198'}, {'Beatport全球电子舞曲榜': '3812895'}, {'法国 NRJ Vos Hits 周榜': '27135204'}, {'KTV唛榜': '21845217'},
              {'iTunes榜': '11641012'}, {'日本Oricon周榜': '60131'}, {'Hit FM Top榜': '120001'}, {'台湾Hito排行榜': '112463'},
              {'香港电台中文歌曲龙虎榜': '10169002'}, {'新声榜': '2617766278'}, {'以团之名发光榜': '2629421353'}]
}

top_dict = {'19723756': '云音乐飙升榜', '3779629': '云音乐新歌榜', '2884035': '网易原创歌曲榜', '3778678': '云音乐热歌榜',
            '991319590': '江小白YOLO云音乐说唱榜', '2534472105': '国风风云榜', '1978921795': '云音乐电音榜',
            '2572444046': '斗鱼音乐榜', '2250011882': '抖音排行榜', '71385702': '云音乐ACG音乐榜', '71384707': '云音乐古典音乐榜',
            '745956260': '云音乐韩语榜', '10520166': '云音乐国电榜', '2023401535': '英国Q杂志中文版周榜', '2006508653': '电竞音乐榜',
            '180106': 'UK排行榜周榜', '60198': '美国Billboard周榜', '3812895': 'Beatport全球电子舞曲榜',
            '27135204': '法国 NRJ Vos Hits 周榜', '21845217': 'KTV唛榜', '11641012': 'iTunes榜', '60131': '日本Oricon周榜',
            '120001': 'Hit FM Top榜', '112463': '台湾Hito排行榜', '10169002': '香港电台中文歌曲龙虎榜', '2617766278': '新声榜',
            '2629421353': '以团之名发光榜'
            }

djradio_dict = {'有声书': '10001', '知识技能': '453050', '商业财经': '453051', '人文历史': '11', '外语世界': '13',
                '亲子宝贝': '14', '创作|翻唱': '2001', '音乐故事': '2', '3D|电子': '10002', '相声曲艺': '8',
                '情感调频': '3', '美文读物': '6', '脱口秀': '5', '广播剧': '7', '二次元': '3001', '明星做主播': '1',
                '娱乐|影视': '4', '科技科学': '453052', '校园|教育': '4001', '旅途|城市': '12'}


headers = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36 SE 2.X MetaSr 1.0',
    'Referer': 'https://music.163.com/',
    'Host': 'music.163.com'
}

songsheet_url = 'https://music.163.com/discover/playlist/?order=hot&cat={}&limit=35&offset={}'
music_url = 'https://music.163.com/api/playlist/detail?id={}'
lyric_url = 'http://music.163.com/api/song/lyric?os=pc&id={}&lv=-1&kv=-1&tv=-1'

comment_url = 'https://music.163.com/weapi/v1/resource/comments/R_SO_4_{}?csrf_token='
comment_api = 'http://music.163.com/api/v1/resource/comments/R_SO_4_{}?limit=20&offset={}'

song_url = 'https://music.163.com/song?id={}'
search_url = 'http://music.163.com/api/search/pc'

toplist_url = 'https://music.163.com/discover/toplist?id={}'
djradio_url = 'https://music.163.com/discover/djradio/category?id={}&order={}&_hash=allradios&limit=30&offset={}'
radio_url = 'https://music.163.com/djradio?id={}&order={}&_hash=programlist&limit=100&offset={}'